Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/starting_work_and_changing_job/changing_job/giving_notice.html.txt.tmx
Source language: en
Languages: ga

source: Giving notice when changing your job
ga: Ag tabhairt fógra le hathrú jabanna

source: • Obtaining references when leaving employment
ga: • Teastais a fháil ó fhostóir agus tú ag fágáil poist

source: If you are changing your job, you are required by law to give your present employer notice of your decision to leave
ga: Má tá tú ag athrú do phost , caithfidh tú de réir an dlí fógra a thabhairt do d’fhostóir reatha go bhfuil sé i gceist agat éirí as

source: The actual length of the notice you are required to give will depend on your contract of employment and on the minimum notice that you are required to give by law
ga: Braithfidh fad an fhógra a chaithfidh tú a thabhairt ar do chonradh fostaíochta agus ar an íostréimhse fógra a chaithfidh tú a thabhairt de réir an dlí

source: The principal legislation governing this area employment law in Ireland is the Minimum Notice and Terms of Employment Acts 1973–2005
ga: Is í an phríomhreachtaíocht atá i bhfeidhm sa réimse seo den dlí a bhaineann le fostaíocht in Éirinn ná tAcht um Fhógra Íosta agus Téarmaí Fostaíochta 1973 - 2005

source: You can read more in our document about minimum periods of notice from employers
ga: Leigh tuilleadh inár ndoiciméad faoi bhunthréimhse do fhógra scoir

source: A contract of employment may be agreed by word of mouth or may be set out in writing
ga: D’fhéadfadh conradh fostaíochta a bheith aontaithe le focal béil nó a bheith leagtha amach i scríbhinn

source: Requirements as to notice are among the items in a contract of employment that should, by law, be in written form
ga: De réir an dlí is iad riachtanais maidir le fógra ar chuid de na nithe a chaithfidh a bheith i bhfoirm scríofa

source: You should therefore check your contract of employment for any provisions as to the notice you are required to give and follow those provisions
ga: Ba cheart duit, mar sin, na forálacha a bhaineann leis an bhfógra a chaithfidh tú a thabhairt a sheiceáil i do chonradh fostaíochta agus iad sin a leanúint

source: Remember that it is always open to agree a different arrangement to that contained in your contract with your employer
ga: Meabhraigh gur féidir i gcónaí socrú eile seachas an ceann atá sa chonradh le d’fhostóir a dhéanamh

source: If you do not have a provision in your contract of employment dealing with notice, the statutory minimum notice of one week will apply and this is the notice that you should give your employer of your intention to leave
ga: Muna bhfuil foráil i do chonradh fostaíochta a phléann fógra, tiocfaidh an fógra íosta reachtúil de sheachtain amháin i bhfeidhm agus is é seo an fógra ba cheart duit a thabhairt do d’fhostóir

source: The statutory minimum notice of one week, is set down in Section 6 of the Minimum Notice and Terms of Employment Act 1973
ga: Tá an fógra íosta reachtúil de sheachtain amháin leagtha síos in Alt 6 den Acht um Fhógra Íosta agus Téarmaí Fostaíochta 1973

source: Situations where notice is not required
ga: Cúinsí nuair nach bhfuil fógra ag teastáil

source: An employer is entitled to at least one week's notice from an employee who has been working for the employer for 13 weeks or more
ga: Tá fostóir i dteideal fógra seachtaine, ar a laghad, a fháil ó fhostaí má d’oibrigh an fostaí don fhostóir ar feadh 13 seachtaine nó ní b’fhaide

source: If an employee has been working for an employer for less than 13 weeks and has no contractual obligation to give notice then the employee is not obliged to give notice
ga: Má bhí fostaí ag oibriú d’fhostóir ar feadh ní ba lú ná 13 seachtaine agus mura bhfuil aon dualgas conarthach air/uirthi chun fógra a thabhairt, níl dualgas ar an bhfostaí fógra a thabhairt

source: An employer is not bound to give an employee the minimum notice of one week if the employee has been working for the employer for less than 13 weeks or in situations where the employee is guilty of gross misconduct
ga: Má bhí fostaí ag obair d’fhostóir le haghaidh tréimhse níos lú ná 13 seachtaine nó sa chás go raibh an fostaí ciontach i dtaobh drochiompair thromchúisigh, ní chaithfidh an fostóir an fógra íosta de sheachtain amháin a thabhairt don bhfostaí

source: Waiving your right to notice
ga: Do cheart chun fógra a fháil a tharscaoileadh

source: Employment legislation also sets down that if an employer and an employee agree, the employee can waive their right to notice
ga: Tá sé leagtha síos i reachtaíocht fhostaíochta gur féidir le fostaí a c(h)eart chun fógra a fháil a tharscaoileadh, má aontaíonn an fostóir agus an fostaí araon

source: In addition, where the employer and employee agree, the employer can pay the employee in lieu of notice
ga: Chomh maith leis sin, má aontaíonn an fostóir agus an fostaí, is féidir leis an bhfostóir an fostaí a íoc in áit fógra a thabhairt

source: If you accept payment in lieu of notice, then the date of termination of your employment is the date on which notice (if it had been given) would have expired
ga: Má ghlacann tú le híocaíocht in áit fógra, is é an dáta ar a mbeadh an fógra istigh (dá dtabharfaí é) an dáta ar a gcríochnaíonn d’fhostaíocht

source: These rights are set down in Section 7 of the Minimum Notice and Terms of Employment Act 1973
ga: Tá na cearta seo leagtha síos in Alt 7 den Acht um Fhógra Íosta agus Téarmaí Fostaíochta 1973

source: The legislation does not address the use of annual leave due in lieu of notice
ga: Ní chlúdaíonn an reachtaíocht úsáid a bhaint as saoire bhliantúil nár tógadh in ionad fógra scoir a thabhairt

source: This is a matter for agreement between employer and employee
ga: Is ceist í seo ar chóir a shocrú idir an fostóir agus an fostaí

source: However any employee leaving a job is entitled to payment for any outstanding annual leave
ga: Ag an am céanna, bíonn fostaí a fhágann a phost i dteideal íocaíocht a fháil ar son aon saoire bhliantúil nár tógadh

source: Once given, you cannot withdraw your notice to terminate your employment, unless you can reach an agreement with your employer to do so
ga: Ní féidir leat d’fhógra go bhfuil tú ag cur deireadh le d’fhostaíocht a tharraingt siar ach amháin má tá tú in ann é sin a shocrú le d’fhostóir

source: The statutory minimum notice requirement by an employee is contained in the the Minimum Notice and Terms of Employment Acts, 1973–2005
ga: Tá an fógra íosta reachtúil a chaithfidh fostaí a thabhairt le fáil sna hAchtanna um Fhógra Íosta agus Téarmaí Fostaíochta 1973–2005

source: Obtaining references when leaving employment
ga: Teastais a fháil ó fhostóir agus tú ag fágáil poist

source: If you are moving to a new employer you may want to ask your current or former employer for a reference
ga: Má tá tú ag bogadh go dtí fostóir nua, b’fhéidir gur mian leat iarraidh ar d’fhostóir reatha nó d’iar-fhostóir teistiméireacht a thabhairt duit

source: This can be written or oral
ga: D’fhéadfadh an teistiméireacht seo a bheith scríofa nó ó bhéal

source: A written reference may be entirely factual describing, for example, how long you have worked for the particular employer, the level of decision making for which you were responsible or your absentee rate
ga: D’fhéadfadh teistiméireacht scríofa bheith go hiomlán fíriciúil, agus d’fheadfaidís cur síos a dhéanamh, mar shampla, ar cé chomh fada a d’oibrigh tú don fhostóir ar leith, an leibhéal de chinnteoireacht as a raibh tú freagrach nó do ráta neamhláithreachta

source: It may also include an appraisal by the employer of how you carried out your work and your suitability for a particular position
ga: D’fhéadfaí a áireamh leis an teistiméireacht, chomh maith, measúnú a dhéanann an fostóir ar conas a thug tú faoi do chuid oibre agus d’oiriúnacht do phost ar leith

source: Entitlement to a reference
ga: Teidlíocht chun teistiméireacht a fháil

source: You do not have a statutory entitlement to either a written or an oral reference from your current or previous employer
ga: Níl teidlíocht reachtúil agat chun teistiméireacht scríofa nó ó bhéal a fháil ó d’fhostóir reatha nó d’iar-fhostóir

source: Your contract of employment may explicitly state that the employer will provide a reference when you leave but this seems to be rare
ga: D’fhéadfadh go luafaí go sainráite i do chonradh fostaíochta go soláthróidh an fostóir teistiméireacht ar fhágáil duit ach is dealraitheach gurb annamh a dhéantar seo

source: It is the custom and practice of certain employers and some sectors to provide references and such a custom or practice may be regarded as part of your terms and conditions of employment
ga: Tá sé mar nós agus cleachtas roinnt fostóirí agus roinnt earnálacha chun teistiméireachtaí a sholáthar agus féadtar caitheamh lena leithéid de nós nó cleachtas mar chuid de do théarmaí agus coinníollacha fostaíochta

source: This depends on the facts in each individual case
ga: Braitheann seo ar na fíricí i ngach cás aonair

source: If an employer gives a reference to one employee but not to another, the issue of discrimination could arise
ga: Má thugann fostóir teistiméireacht d’fhostaí amháin ach mura dtugann sé/sí ceann d’fhostaí eile, d’fhéadfadh saincheist an idirdhealaithe teacht chun solais

source: The employer has a duty of care to you and to the prospective new employer
ga: Tá dualgas cúraim ar an bhfostóir i do leith agus i leith an fhostaí ionchasaigh nua

source: If your employer does give you a reference, it must be true, fair, accurate and not misleading
ga: Má thugann d’fhostóir teistiméireacht duit, ní mór di bheith fíor, cothrom, cruinn agus gan bheith míthreorach

source: If you are given a reference which you consider to be unfair or inaccurate, you may be able to sue that employer for negligence
ga: Má thugtar teistiméireacht duit a mheasann tú atá éagórach nó míchruinn, b’fhéidir go mbeidh tú in ann agairt a dhéanamh ar an bhfostóir sin mar gheall ar fhaillí

source: You would have to show that you suffered a loss, for example, that a job offer was withdrawn as a result of the reference
ga: Bheadh ort a thaispeáint go raibh tú thíos le caillteanas, mar shampla, gur aistarraingíodh tairiscint poist de dheasca na teistiméireachta

source: If you consider that the reference is defamatory, you may seek redress under the Defamation Act 2009
ga: Má mheasann tú go bhfuil an teistiméireacht clúmhillteach, féadfaidh tú a lorg go gceartaítear seo faoin Acht um Chlúmhilleadh, 2009

source: A prospective employer who is misled by an inaccurate reference may make a negligence claim against the employer who provided the reference
ga: Féadfaidh fostóir ionchasach atá míthreoraithe ag teistiméireacht mhíchruinn éileamh faillí a dhéanamh i leith an fhostóra a sholáthair an teistiméireacht

source: Written references are part of your personnel records
ga: Bíonn teistiméireachtaí scríofa mar chuid de do thaifid phearsanra

source: Oral references may also be if the new employer made a note of what was said
ga: D’fhéadfadh go bhfuil teistiméireachtaí ó bhéal mar chuid díobh, chomh maith, má bhreac an fostóir nóta síos faoin méid a dúradh

source: Under the Data Protection Acts, you are entitled to have access to information held about you including your personnel records
ga: Faoi na hAchtanna um Chosaint Sonraí, tá tú i dteideal rochtain a fháil ar fhaisnéis a choimeádtar fút, do thaifid phearsanra san áireamh

source: You may access personal data which contains an expression of opinion about you unless the expression of opinion was given in confidence or on the understanding that it would be treated as confidential
ga: Féadfaidh tú rochtain a fháil ar shonraí pearsanta ina nochtar tuairim fút, murar tugadh nochtadh na tuairime in iontaoibh nó ar an tuiscint go gcaithfí leis amhail bheith faoi rún

source: The Data Protection Commissioner has held that, in these cases, there is a high threshold of confidentiality to be met
ga: D’fhógair an Coimisinéir Cosanta Sonraí, sna cásanna seo, go bhfuil ardtairseach rúndachta le baint amach

source: Simply placing the word ‘confidential’ at the top of a page does not automatically render the data confidential
ga: Mura gcuirtear ach an focal ‘faoi rún’ ag barr an leathanaigh, ní dhéantar sonraí rúnda, go huathoibríoch, de na sonraí

source: As a general rule, any opinions on an individual supplied by a supervisor or manager may not be restricted under this provision. Where to apply
ga: Mar riail ghinearálta, ní féidir srian a chur ar aon tuairimí ar dhuine aonair a sholáthraíonn maoirseoir nó bainisteoir faoin bhforáil seo
